turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
        <register caption="Mailbox Acceptance Mask Register (MB = 3)" name="CAN_MAM3" offset="0x264" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox ID Register (MB = 3)" name="CAN_MID3" offset="0x268" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 3)" name="CAN_MFID3" offset="0x26C" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 3)" name="CAN_MSR3" offset="0x270" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 3)" name="CAN_MDL3" offset="0x274" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 3)" name="CAN_MDH3" offset="0x278" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 3)" name="CAN_MCR3" offset="0x27C" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 4)" name="CAN_MMR4" offset="0x280" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR4__MOT"/>
        </register>
        <register caption="Mailbox Acceptance Mask Register (MB = 4)" name="CAN_MAM4" offset="0x284" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox ID Register (MB = 4)" name="CAN_MID4" offset="0x288" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
        <register caption="Mailbox Family ID Register (MB = 4)" name="CAN_MFID4" offset="0x28C" rw="R" size="4">
          <bitfield caption="Family ID" mask="0x1FFFFFFF" name="MFID"/>
        </register>
        <register caption="Mailbox Status Register (MB = 4)" name="CAN_MSR4" offset="0x290" rw="R" size="4">
          <bitfield caption="Timer value" mask="0x0000FFFF" name="MTIMESTAMP"/>
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Mailbox Message Abort" mask="0x00400000" name="MABT"/>
          <bitfield caption="Mailbox Ready" mask="0x00800000" name="MRDY"/>
          <bitfield caption="Mailbox Message Ignored" mask="0x01000000" name="MMI"/>
        </register>
        <register caption="Mailbox Data Low Register (MB = 4)" name="CAN_MDL4" offset="0x294" rw="RW" size="4">
          <bitfield caption="Message Data Low Value" mask="0xFFFFFFFF" name="MDL"/>
        </register>
        <register caption="Mailbox Data High Register (MB = 4)" name="CAN_MDH4" offset="0x298" rw="RW" size="4">
          <bitfield caption="Message Data High Value" mask="0xFFFFFFFF" name="MDH"/>
        </register>
        <register caption="Mailbox Control Register (MB = 4)" name="CAN_MCR4" offset="0x29C" rw="W" size="4">
          <bitfield caption="Mailbox Data Length Code" mask="0x000F0000" name="MDLC"/>
          <bitfield caption="Mailbox Remote Transmission Request" mask="0x00100000" name="MRTR"/>
          <bitfield caption="Abort Request for Mailbox x" mask="0x00400000" name="MACR"/>
          <bitfield caption="Mailbox Transfer Command" mask="0x00800000" name="MTCR"/>
        </register>
        <register caption="Mailbox Mode Register (MB = 5)" name="CAN_MMR5" offset="0x2A0" rw="RW" size="4">
          <bitfield caption="Mailbox Timemark" mask="0x0000FFFF" name="MTIMEMARK"/>
          <bitfield caption="Mailbox Priority" mask="0x000F0000" name="PRIOR"/>
          <bitfield caption="Mailbox Object Type" mask="0x07000000" name="MOT" values="CAN_MMR5__MOT"/>
        </register>
        <register caption="Mailbox Acceptance Mask Register (MB = 5)" name="CAN_MAM5" offset="0x2A4" rw="RW" size="4">
          <bitfield caption="Complementary bits for identifier in extended frame mode" mask="0x0003FFFF" name="MIDvB"/>
          <bitfield caption="Identifier for standard frame mode" mask="0x1FFC0000" name="MIDvA"/>
          <bitfield caption="Identifier Version" mask="0x20000000" name="MIDE"/>
        </register>
