turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
      <value-group caption="" name="SSC_TFMR__FSEDGE">
        <value caption="Positive Edge Detection" name="POSITIVE" value="0"/>
        <value caption="Negative Edge Detection" name="NEGATIVE" value="1"/>
      </value-group>
      <value-group caption="" name="SSC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x535343"/>
      </value-group>
    </module>
    <module caption="Supply Controller" name="SUPC" version="6452S">
      <register-group name="SUPC">
        <register caption="Supply Controller Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Voltage Regulator Off" mask="0x00000004" name="VROFF" values="SUPC_CR__VROFF"/>
          <bitfield caption="Crystal Oscillator Select" mask="0x00000008" name="XTALSEL" values="SUPC_CR__XTALSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SUPC_CR__KEY"/>
        </register>
        <register caption="Supply Controller Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Supply Monitor Threshold" mask="0x0000000F" name="SMTH"/>
          <bitfield caption="Supply Monitor Sampling Period" mask="0x00000700" name="SMSMPL" values="SUPC_SMMR__SMSMPL"/>
          <bitfield caption="Supply Monitor Reset Enable" mask="0x00001000" name="SMRSTEN" values="SUPC_SMMR__SMRSTEN"/>
          <bitfield caption="Supply Monitor Interrupt Enable" mask="0x00002000" name="SMIEN" values="SUPC_SMMR__SMIEN"/>
        </register>
        <register caption="Supply Controller Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Brownout Detector Reset Enable" mask="0x00001000" name="BODRSTEN" values="SUPC_MR__BODRSTEN"/>
          <bitfield caption="Brownout Detector Disable" mask="0x00002000" name="BODDIS" values="SUPC_MR__BODDIS"/>
          <bitfield caption="VDDIO Ready" mask="0x00004000" name="VDDIORDY" values="SUPC_MR__VDDIORDY"/>
          <bitfield caption="Oscillator Bypass" mask="0x00100000" name="OSCBYPASS" values="SUPC_MR__OSCBYPASS"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_MR__KEY"/>
        </register>
        <register caption="Supply Controller Wake-up Mode Register" name="SUPC_WUMR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Force Wake-up Enable" mask="0x00000001" name="FWUPEN" values="SUPC_WUMR__FWUPEN"/>
          <bitfield caption="Supply Monitor Wake-up Enable" mask="0x00000002" name="SMEN" values="SUPC_WUMR__SMEN"/>
          <bitfield caption="Real Time Timer Wake-up Enable" mask="0x00000004" name="RTTEN" values="SUPC_WUMR__RTTEN"/>
          <bitfield caption="Real Time Clock Wake-up Enable" mask="0x00000008" name="RTCEN" values="SUPC_WUMR__RTCEN"/>
          <bitfield caption="Force Wake-up Debouncer Period" mask="0x00000700" name="FWUPDBC" values="SUPC_WUMR__FWUPDBC"/>
          <bitfield caption="Wake-up Inputs Debouncer Period" mask="0x00007000" name="WKUPDBC" values="SUPC_WUMR__WKUPDBC"/>
        </register>
        <register caption="Supply Controller Wake-up Inputs Register" name="SUPC_WUIR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Wake-up Input Enable 0" mask="0x00000001" name="WKUPEN0" values="SUPC_WUIR__WKUPEN0"/>
          <bitfield caption="Wake-up Input Enable 1" mask="0x00000002" name="WKUPEN1" values="SUPC_WUIR__WKUPEN1"/>
          <bitfield caption="Wake-up Input Enable 2" mask="0x00000004" name="WKUPEN2" values="SUPC_WUIR__WKUPEN2"/>
          <bitfield caption="Wake-up Input Enable 3" mask="0x00000008" name="WKUPEN3" values="SUPC_WUIR__WKUPEN3"/>
          <bitfield caption="Wake-up Input Enable 4" mask="0x00000010" name="WKUPEN4" values="SUPC_WUIR__WKUPEN4"/>
          <bitfield caption="Wake-up Input Enable 5" mask="0x00000020" name="WKUPEN5" values="SUPC_WUIR__WKUPEN5"/>
          <bitfield caption="Wake-up Input Enable 6" mask="0x00000040" name="WKUPEN6" values="SUPC_WUIR__WKUPEN6"/>
          <bitfield caption="Wake-up Input Enable 7" mask="0x00000080" name="WKUPEN7" values="SUPC_WUIR__WKUPEN7"/>
          <bitfield caption="Wake-up Input Enable 8" mask="0x00000100" name="WKUPEN8" values="SUPC_WUIR__WKUPEN8"/>
          <bitfield caption="Wake-up Input Enable 9" mask="0x00000200" name="WKUPEN9" values="SUPC_WUIR__WKUPEN9"/>
          <bitfield caption="Wake-up Input Enable 10" mask="0x00000400" name="WKUPEN10" values="SUPC_WUIR__WKUPEN10"/>
          <bitfield caption="Wake-up Input Enable 11" mask="0x00000800" name="WKUPEN11" values="SUPC_WUIR__WKUPEN11"/>
          <bitfield caption="Wake-up Input Enable 12" mask="0x00001000" name="WKUPEN12" values="SUPC_WUIR__WKUPEN12"/>
          <bitfield caption="Wake-up Input Enable 13" mask="0x00002000" name="WKUPEN13" values="SUPC_WUIR__WKUPEN13"/>
          <bitfield caption="Wake-up Input Enable 14" mask="0x00004000" name="WKUPEN14" values="SUPC_WUIR__WKUPEN14"/>
          <bitfield caption="Wake-up Input Enable 15" mask="0x00008000" name="WKUPEN15" values="SUPC_WUIR__WKUPEN15"/>
          <bitfield caption="Wake-up Input Type 0" mask="0x00010000" name="WKUPT0" values="SUPC_WUIR__WKUPT0"/>
          <bitfield caption="Wake-up Input Type 1" mask="0x00020000" name="WKUPT1" values="SUPC_WUIR__WKUPT1"/>
          <bitfield caption="Wake-up Input Type 2" mask="0x00040000" name="WKUPT2" values="SUPC_WUIR__WKUPT2"/>
          <bitfield caption="Wake-up Input Type 3" mask="0x00080000" name="WKUPT3" values="SUPC_WUIR__WKUPT3"/>
          <bitfield caption="Wake-up Input Type 4" mask="0x00100000" name="WKUPT4" values="SUPC_WUIR__WKUPT4"/>
          <bitfield caption="Wake-up Input Type 5" mask="0x00200000" name="WKUPT5" values="SUPC_WUIR__WKUPT5"/>
          <bitfield caption="Wake-up Input Type 6" mask="0x00400000" name="WKUPT6" values="SUPC_WUIR__WKUPT6"/>
          <bitfield caption="Wake-up Input Type 7" mask="0x00800000" name="WKUPT7" values="SUPC_WUIR__WKUPT7"/>
          <bitfield caption="Wake-up Input Type 8" mask="0x01000000" name="WKUPT8" values="SUPC_WUIR__WKUPT8"/>
          <bitfield caption="Wake-up Input Type 9" mask="0x02000000" name="WKUPT9" values="SUPC_WUIR__WKUPT9"/>
          <bitfield caption="Wake-up Input Type 10" mask="0x04000000" name="WKUPT10" values="SUPC_WUIR__WKUPT10"/>
          <bitfield caption="Wake-up Input Type 11" mask="0x08000000" name="WKUPT11" values="SUPC_WUIR__WKUPT11"/>
          <bitfield caption="Wake-up Input Type 12" mask="0x10000000" name="WKUPT12" values="SUPC_WUIR__WKUPT12"/>
          <bitfield caption="Wake-up Input Type 13" mask="0x20000000" name="WKUPT13" values="SUPC_WUIR__WKUPT13"/>
          <bitfield caption="Wake-up Input Type 14" mask="0x40000000" name="WKUPT14" values="SUPC_WUIR__WKUPT14"/>
          <bitfield caption="Wake-up Input Type 15" mask="0x80000000" name="WKUPT15" values="SUPC_WUIR__WKUPT15"/>
        </register>
