turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
        <register caption="Slave Mode Register" name="TWI_SMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
        </register>
        <register caption="Internal Address Register" name="TWI_IADR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="Clock Waveform Generator Register" name="TWI_CWGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
        </register>
        <register caption="Status Register" name="TWI_SR" offset="0x20" rw="R" size="4">
          <bitfield caption="Transmission Completed (automatically set / reset)" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (automatically set / reset)" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (automatically set / reset)" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Read (automatically set / reset)" mask="0x00000008" name="SVREAD"/>
          <bitfield caption="Slave Access (automatically set / reset)" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access (clear on read)" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error (clear on read)" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledged (clear on read)" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost (clear on read)" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State (automatically set / reset)" mask="0x00000400" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (clear on read)" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of RX buffer" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of TX buffer" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="RX Buffer Full" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Enable Register" name="TWI_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Enable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Enable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Enable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledge Interrupt Enable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Enable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Enable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Enable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Disable Register" name="TWI_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Transmission Completed Interrupt Disable" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Disable" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Disable" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledge Interrupt Disable" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Disable" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Disable" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Disable" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Mask Register" name="TWI_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Transmission Completed Interrupt Mask" mask="0x00000001" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Slave Access Interrupt Mask" mask="0x00000010" name="SVACC"/>
          <bitfield caption="General Call Access Interrupt Mask" mask="0x00000020" name="GACC"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000040" name="OVRE"/>
          <bitfield caption="Not Acknowledge Interrupt Mask" mask="0x00000100" name="NACK"/>
          <bitfield caption="Arbitration Lost Interrupt Mask" mask="0x00000200" name="ARBLST"/>
          <bitfield caption="Clock Wait State Interrupt Mask" mask="0x00000400" name="SCL_WS"/>
          <bitfield caption="End Of Slave Access Interrupt Mask" mask="0x00000800" name="EOSACC"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00001000" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00002000" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00008000" name="TXBUFE"/>
        </register>
        <register caption="Receive Holding Register" name="TWI_RHR" offset="0x30" rw="R" size="4">
          <bitfield caption="Master or Slave Receive Holding Data" mask="0x000000FF" name="RXDATA"/>
        </register>
