turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
        <register caption="Device Global Interrupt Set Register" name="UOTGHS_DEVIFR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Set" mask="0x00000001" name="SUSPS"/>
          <bitfield caption="Micro Start of Frame Interrupt Set" mask="0x00000002" name="MSOFS"/>
          <bitfield caption="Start of Frame Interrupt Set" mask="0x00000004" name="SOFS"/>
          <bitfield caption="End of Reset Interrupt Set" mask="0x00000008" name="EORSTS"/>
          <bitfield caption="Wake-Up Interrupt Set" mask="0x00000010" name="WAKEUPS"/>
          <bitfield caption="End of Resume Interrupt Set" mask="0x00000020" name="EORSMS"/>
          <bitfield caption="Upstream Resume Interrupt Set" mask="0x00000040" name="UPRSMS"/>
          <bitfield caption="DMA Channel 1 Interrupt Set" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Set" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Set" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Set" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Set" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Set" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="Device Global Interrupt Mask Register" name="UOTGHS_DEVIMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Suspend Interrupt Mask" mask="0x00000001" name="SUSPE"/>
          <bitfield caption="Micro Start of Frame Interrupt Mask" mask="0x00000002" name="MSOFE"/>
          <bitfield caption="Start of Frame Interrupt Mask" mask="0x00000004" name="SOFE"/>
          <bitfield caption="End of Reset Interrupt Mask" mask="0x00000008" name="EORSTE"/>
          <bitfield caption="Wake-Up Interrupt Mask" mask="0x00000010" name="WAKEUPE"/>
          <bitfield caption="End of Resume Interrupt Mask" mask="0x00000020" name="EORSME"/>
          <bitfield caption="Upstream Resume Interrupt Mask" mask="0x00000040" name="UPRSME"/>
          <bitfield caption="Endpoint 0 Interrupt Mask" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Mask" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Mask" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Mask" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Mask" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt Mask" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt Mask" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt Mask" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt Mask" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt Mask" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt Mask" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Mask" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Mask" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Mask" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Mask" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Mask" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="Device Global Interrupt Disable Register" name="UOTGHS_DEVIDR" offset="0x0014" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Disable" mask="0x00000001" name="SUSPEC"/>
          <bitfield caption="Micro Start of Frame Interrupt Disable" mask="0x00000002" name="MSOFEC"/>
          <bitfield caption="Start of Frame Interrupt Disable" mask="0x00000004" name="SOFEC"/>
          <bitfield caption="End of Reset Interrupt Disable" mask="0x00000008" name="EORSTEC"/>
          <bitfield caption="Wake-Up Interrupt Disable" mask="0x00000010" name="WAKEUPEC"/>
          <bitfield caption="End of Resume Interrupt Disable" mask="0x00000020" name="EORSMEC"/>
          <bitfield caption="Upstream Resume Interrupt Disable" mask="0x00000040" name="UPRSMEC"/>
          <bitfield caption="Endpoint 0 Interrupt Disable" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Disable" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Disable" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Disable" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Disable" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt Disable" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt Disable" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt Disable" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt Disable" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt Disable" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt Disable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Disable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Disable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Disable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Disable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Disable" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="Device Global Interrupt Enable Register" name="UOTGHS_DEVIER" offset="0x0018" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Enable" mask="0x00000001" name="SUSPES"/>
          <bitfield caption="Micro Start of Frame Interrupt Enable" mask="0x00000002" name="MSOFES"/>
          <bitfield caption="Start of Frame Interrupt Enable" mask="0x00000004" name="SOFES"/>
          <bitfield caption="End of Reset Interrupt Enable" mask="0x00000008" name="EORSTES"/>
          <bitfield caption="Wake-Up Interrupt Enable" mask="0x00000010" name="WAKEUPES"/>
          <bitfield caption="End of Resume Interrupt Enable" mask="0x00000020" name="EORSMES"/>
          <bitfield caption="Upstream Resume Interrupt Enable" mask="0x00000040" name="UPRSMES"/>
          <bitfield caption="Endpoint 0 Interrupt Enable" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Enable" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Enable" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Enable" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Enable" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt Enable" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt Enable" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt Enable" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt Enable" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt Enable" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Enable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Enable" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="Device Endpoint Register" name="UOTGHS_DEVEPT" offset="0x001C" rw="RW" size="4">
          <bitfield caption="Endpoint 0 Enable" mask="0x00000001" name="EPEN0"/>
          <bitfield caption="Endpoint 1 Enable" mask="0x00000002" name="EPEN1"/>
          <bitfield caption="Endpoint 2 Enable" mask="0x00000004" name="EPEN2"/>
          <bitfield caption="Endpoint 3 Enable" mask="0x00000008" name="EPEN3"/>
          <bitfield caption="Endpoint 4 Enable" mask="0x00000010" name="EPEN4"/>
          <bitfield caption="Endpoint 5 Enable" mask="0x00000020" name="EPEN5"/>
          <bitfield caption="Endpoint 6 Enable" mask="0x00000040" name="EPEN6"/>
          <bitfield caption="Endpoint 7 Enable" mask="0x00000080" name="EPEN7"/>
          <bitfield caption="Endpoint 8 Enable" mask="0x00000100" name="EPEN8"/>
          <bitfield caption="Endpoint 0 Reset" mask="0x00010000" name="EPRST0"/>
          <bitfield caption="Endpoint 1 Reset" mask="0x00020000" name="EPRST1"/>
          <bitfield caption="Endpoint 2 Reset" mask="0x00040000" name="EPRST2"/>
          <bitfield caption="Endpoint 3 Reset" mask="0x00080000" name="EPRST3"/>
          <bitfield caption="Endpoint 4 Reset" mask="0x00100000" name="EPRST4"/>
          <bitfield caption="Endpoint 5 Reset" mask="0x00200000" name="EPRST5"/>
          <bitfield caption="Endpoint 6 Reset" mask="0x00400000" name="EPRST6"/>
          <bitfield caption="Endpoint 7 Reset" mask="0x00800000" name="EPRST7"/>
          <bitfield caption="Endpoint 8 Reset" mask="0x01000000" name="EPRST8"/>
        </register>
        <register caption="Device Frame Number Register" name="UOTGHS_DEVFNUM" offset="0x0020" rw="R" size="4">
          <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Number CRC Error" mask="0x00008000" name="FNCERR"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 0" name="UOTGHS_DEVEPTCFG0" offset="0x100" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 1" name="UOTGHS_DEVEPTCFG1" offset="0x104" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 2" name="UOTGHS_DEVEPTCFG2" offset="0x108" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 3" name="UOTGHS_DEVEPTCFG3" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 4" name="UOTGHS_DEVEPTCFG4" offset="0x110" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 5" name="UOTGHS_DEVEPTCFG5" offset="0x114" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 6" name="UOTGHS_DEVEPTCFG6" offset="0x118" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transaction per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="UOTGHS_DEVEPTCFG__NBTRANS"/>
        </register>
