turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
        <register caption="Host DMA Channel Next Descriptor Address Register (n = 5)" name="UOTGHS_HSTDMANXTDSC5" offset="0x750" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Host DMA Channel Address Register (n = 5)" name="UOTGHS_HSTDMAADDRESS5" offset="0x754" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Host DMA Channel Control Register (n = 5)" name="UOTGHS_HSTDMACONTROL5" offset="0x758" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Host DMA Channel Status Register (n = 5)" name="UOTGHS_HSTDMASTATUS5" offset="0x75C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Host DMA Channel Next Descriptor Address Register (n = 6)" name="UOTGHS_HSTDMANXTDSC6" offset="0x760" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Host DMA Channel Address Register (n = 6)" name="UOTGHS_HSTDMAADDRESS6" offset="0x764" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Host DMA Channel Control Register (n = 6)" name="UOTGHS_HSTDMACONTROL6" offset="0x768" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Host DMA Channel Status Register (n = 6)" name="UOTGHS_HSTDMASTATUS6" offset="0x76C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Host DMA Channel Next Descriptor Address Register (n = 7)" name="UOTGHS_HSTDMANXTDSC7" offset="0x770" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Host DMA Channel Address Register (n = 7)" name="UOTGHS_HSTDMAADDRESS7" offset="0x774" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Host DMA Channel Control Register (n = 7)" name="UOTGHS_HSTDMACONTROL7" offset="0x778" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Host DMA Channel Status Register (n = 7)" name="UOTGHS_HSTDMASTATUS7" offset="0x77C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="General Control Register" name="UOTGHS_CTRL" offset="0x0800" rw="RW" size="4">
          <bitfield caption="ID Transition Interrupt Enable" mask="0x00000001" name="IDTE"/>
          <bitfield caption="VBus Transition Interrupt Enable" mask="0x00000002" name="VBUSTE"/>
          <bitfield caption="SRP Interrupt Enable" mask="0x00000004" name="SRPE"/>
          <bitfield caption="VBus Error Interrupt Enable" mask="0x00000008" name="VBERRE"/>
          <bitfield caption="B-Connection Error Interrupt Enable" mask="0x00000010" name="BCERRE"/>
          <bitfield caption="Role Exchange Interrupt Enable" mask="0x00000020" name="ROLEEXE"/>
          <bitfield caption="HNP Error Interrupt Enable" mask="0x00000040" name="HNPERRE"/>
          <bitfield caption="Suspend Time-Out Interrupt Enable" mask="0x00000080" name="STOE"/>
          <bitfield caption="VBus Hardware Control" mask="0x00000100" name="VBUSHWC"/>
          <bitfield caption="SRP Selection" mask="0x00000200" name="SRPSEL"/>
          <bitfield caption="SRP Request" mask="0x00000400" name="SRPREQ"/>
          <bitfield caption="HNP Request" mask="0x00000800" name="HNPREQ"/>
          <bitfield caption="OTG Pad Enable" mask="0x00001000" name="OTGPADE"/>
          <bitfield caption="VBus Polarity Off" mask="0x00002000" name="VBUSPO"/>
          <bitfield caption="Freeze USB Clock" mask="0x00004000" name="FRZCLK"/>
          <bitfield caption="UOTGHS Enable" mask="0x00008000" name="USBE"/>
          <bitfield caption="Timer Value" mask="0x00030000" name="TIMVALUE"/>
          <bitfield caption="Timer Page" mask="0x00300000" name="TIMPAGE"/>
          <bitfield caption="Timer Access Unlock" mask="0x00400000" name="UNLOCK"/>
          <bitfield caption="UOTGID Pin Enable" mask="0x01000000" name="UIDE" values="UOTGHS_CTRL__UIDE"/>
          <bitfield caption="UOTGHS Mode" mask="0x02000000" name="UIMOD" values="UOTGHS_CTRL__UIMOD"/>
        </register>
        <register caption="General Status Register" name="UOTGHS_SR" offset="0x0804" rw="R" size="4">
          <bitfield caption="ID Transition Interrupt" mask="0x00000001" name="IDTI"/>
          <bitfield caption="VBus Transition Interrupt" mask="0x00000002" name="VBUSTI"/>
          <bitfield caption="SRP Interrupt" mask="0x00000004" name="SRPI"/>
          <bitfield caption="VBus Error Interrupt" mask="0x00000008" name="VBERRI"/>
          <bitfield caption="B-Connection Error Interrupt" mask="0x00000010" name="BCERRI"/>
          <bitfield caption="Role Exchange Interrupt" mask="0x00000020" name="ROLEEXI"/>
          <bitfield caption="HNP Error Interrupt" mask="0x00000040" name="HNPERRI"/>
          <bitfield caption="Suspend Time-Out Interrupt" mask="0x00000080" name="STOI"/>
          <bitfield caption="VBus Request" mask="0x00000200" name="VBUSRQ"/>
          <bitfield caption="UOTGID Pin State" mask="0x00000400" name="ID"/>
          <bitfield caption="VBus Level" mask="0x00000800" name="VBUS"/>
          <bitfield caption="Speed Status" mask="0x00003000" name="SPEED" values="UOTGHS_SR__SPEED"/>
          <bitfield caption="UTMI Clock Usable" mask="0x00004000" name="CLKUSABLE"/>
        </register>
        <register caption="General Status Clear Register" name="UOTGHS_SCR" offset="0x0808" rw="W" size="4">
          <bitfield caption="ID Transition Interrupt Clear" mask="0x00000001" name="IDTIC"/>
          <bitfield caption="VBus Transition Interrupt Clear" mask="0x00000002" name="VBUSTIC"/>
          <bitfield caption="SRP Interrupt Clear" mask="0x00000004" name="SRPIC"/>
          <bitfield caption="VBus Error Interrupt Clear" mask="0x00000008" name="VBERRIC"/>
          <bitfield caption="B-Connection Error Interrupt Clear" mask="0x00000010" name="BCERRIC"/>
          <bitfield caption="Role Exchange Interrupt Clear" mask="0x00000020" name="ROLEEXIC"/>
          <bitfield caption="HNP Error Interrupt Clear" mask="0x00000040" name="HNPERRIC"/>
          <bitfield caption="Suspend Time-Out Interrupt Clear" mask="0x00000080" name="STOIC"/>
          <bitfield caption="VBus Request Clear" mask="0x00000200" name="VBUSRQC"/>
        </register>
        <register caption="General Status Set Register" name="UOTGHS_SFR" offset="0x080C" rw="W" size="4">
          <bitfield caption="ID Transition Interrupt Set" mask="0x00000001" name="IDTIS"/>
          <bitfield caption="VBus Transition Interrupt Set" mask="0x00000002" name="VBUSTIS"/>
          <bitfield caption="SRP Interrupt Set" mask="0x00000004" name="SRPIS"/>
          <bitfield caption="VBus Error Interrupt Set" mask="0x00000008" name="VBERRIS"/>
          <bitfield caption="B-Connection Error Interrupt Set" mask="0x00000010" name="BCERRIS"/>
          <bitfield caption="Role Exchange Interrupt Set" mask="0x00000020" name="ROLEEXIS"/>
          <bitfield caption="HNP Error Interrupt Set" mask="0x00000040" name="HNPERRIS"/>
          <bitfield caption="Suspend Time-Out Interrupt Set" mask="0x00000080" name="STOIS"/>
          <bitfield caption="VBus Request Set" mask="0x00000200" name="VBUSRQS"/>
        </register>
