turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
      <value-group caption="" name="UOTGHS_HSTCTRL__SPDCONF">
        <value caption="The host starts in full-speed mode and performs a high-speed reset to switch to the high-speed mode if the downstream peripheral is high-speed capable." name="NORMAL" value="0x0"/>
        <value caption="For a better consumption, if high-speed is not needed." name="LOW_POWER" value="0x1"/>
        <value caption="Forced high speed." name="HIGH_SPEED" value="0x2"/>
        <value caption="The host remains to full-speed mode whatever the peripheral speed capability." name="FORCED_FS" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PBK">
        <value caption="Single-bank pipe" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank pipe" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank pipe" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTOKEN">
        <value caption="SETUP" name="SETUP" value="0x0"/>
        <value caption="IN" name="IN" value="0x1"/>
        <value caption="OUT" name="OUT" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PBK">
        <value caption="Single-bank pipe" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank pipe" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank pipe" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTOKEN">
        <value caption="SETUP" name="SETUP" value="0x0"/>
        <value caption="IN" name="IN" value="0x1"/>
        <value caption="OUT" name="OUT" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PBK">
        <value caption="Single-bank pipe" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank pipe" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank pipe" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTOKEN">
        <value caption="SETUP" name="SETUP" value="0x0"/>
        <value caption="IN" name="IN" value="0x1"/>
        <value caption="OUT" name="OUT" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PBK">
        <value caption="Single-bank pipe" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank pipe" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank pipe" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPCFG__PTOKEN">
        <value caption="SETUP" name="SETUP" value="0x0"/>
        <value caption="IN" name="IN" value="0x1"/>
        <value caption="OUT" name="OUT" value="0x2"/>
      </value-group>
