turbq/atprog/packs/atmel/SAM3A_DFP/1.0.50/atdf/ATSAM3A8C.atdf
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="UOTGHS_HSTPIPISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_CTRL__UIDE">
        <value caption="The USB mode (device/host) is selected from the UIMOD bit." name="UIMOD" value="0"/>
        <value caption="The USB mode (device/host) is selected from the UOTGID input pin." name="UOTGID" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_CTRL__UIMOD">
        <value caption="The module is in USB host mode." name="HOST" value="0"/>
        <value caption="The module is in USB device mode." name="DEVICE" value="1"/>
      </value-group>
      <value-group caption="" name="UOTGHS_SR__SPEED">
        <value caption="Full-Speed mode" name="FULL_SPEED" value="0x0"/>
        <value caption="High-Speed mode" name="HIGH_SPEED" value="0x1"/>
        <value caption="Low-Speed mode" name="LOW_SPEED" value="0x2"/>
      </value-group>
      <value-group caption="" name="UOTGHS_FSM__DRDSTATE">
        <value caption="This is the start state for A-devices (when the ID pin is 0)" name="A_IDLESTATE" value="0x0"/>
        <value caption="In this state, the A-device waits for the voltage on VBus to rise above the A-device VBus Valid threshold (4.4 V)." name="A_WAIT_VRISE" value="0x1"/>
        <value caption="In this state, the A-device waits for the B-device to signal a connection." name="A_WAIT_BCON" value="0x2"/>
        <value caption="In this state, the A-device that operates in Host mode is operational." name="A_HOST" value="0x3"/>
        <value caption="The A-device operating as a host is in the suspend mode." name="A_SUSPEND" value="0x4"/>
        <value caption="The A-device operates as a peripheral." name="A_PERIPHERAL" value="0x5"/>
        <value caption="In this state, the A-device waits for the voltage on VBus to drop below the A-device Session Valid threshold (1.4 V)." name="A_WAIT_VFALL" value="0x6"/>
        <value caption="In this state, the A-device waits for recovery of the over-current condition that caused it to enter this state." name="A_VBUS_ERR" value="0x7"/>
        <value caption="In this state, the A-device waits for the data USB line to discharge (100 us)." name="A_WAIT_DISCHARGE" value="0x8"/>
        <value caption="This is the start state for B-device (when the ID pin is 1)." name="B_IDLE" value="0x9"/>
        <value caption="In this state, the B-device acts as the peripheral." name="B_PERIPHERAL" value="0xA"/>
        <value caption="In this state, the B-device is in suspend mode and waits until 3 ms before initiating the HNP protocol if requested." name="B_WAIT_BEGIN_HNP" value="0xB"/>
        <value caption="In this state, the B-device waits for the data USB line to discharge (100 us) before becoming Host." name="B_WAIT_DISCHARGE" value="0xC"/>
        <value caption="In this state, the B-device waits for the A-device to signal a connect before becoming B-Host." name="B_WAIT_ACON" value="0xD"/>
        <value caption="In this state, the B-device acts as the Host." name="B_HOST" value="0xE"/>
        <value caption="In this state, the B-device attempts to start a session using the SRP protocol." name="B_SRP_INIT" value="0xF"/>
      </value-group>
    </module>
    <module caption="Universal Synchronous Asynchronous Receiver Transmitter" name="USART" version="6089ZF">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Start Time-out" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Rearm Time-out" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" name="LINWKUP"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" name="DSNACK"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC"/>
          <bitfield caption="Inverted Data" mask="0x00800000" name="INVDATA"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" name="MAX_ITERATION"/>
          <bitfield caption="Infrared Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT"/>
        </register>
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt Enable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Disable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Disable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Buffer Empty Interrupt Disable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Disable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt Disable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE"/>
        </register>
